[
  {
    "title": "English for kids",
    "img": "./img/projects/EFK.jpg",
    "technologies": [
        "React",
        "React Hooks",
        "React Router",
        "TypeScript"
      ],
    "text": "Build Create React App. React Application for learning English words. Home page with categories of words. The app has two modes: training and play. In training mode, you can read a word in English, listen to the pronunciation of the word, find the translation on the back of the card. In the game mode, words are played in random order and you need to find a meaning card.",
    "deployLink": "https://rolling-scopes-school.github.io/stavrovadv-JSFE2021Q1/english-for-kids/",
    "codeLink": "https://github.com/stavrovadv/english-for-kids"
  },
  {
    "title": "online-zoo",
    "img": "./img/projects/zoo.jpg",
    "technologies": [
        "HTML5",
        "CSS",
        "Adaptive, cross-browser layout",
        "JavaScript"
      ],
    "text": "Responsive multi-page site about zoo animals with light and dark themes. Home page, animal pages and map with animal markers.",
    "deployLink": "https://stavrovadv.github.io/zoo/pages/landing/",
    "codeLink": "https://github.com/stavrovadv/zoo"
  },
  {
    "title": "Photo-filter",
    "img": "./img/projects/photofilter.jpg",
    "technologies": [
        "Canvas",
        "JavaScript"
      ],
    "text": "It was one of the first js projects. The html and css files were given. Using Canvas, it was necessary to implement: \n1) Displaying a collection of photos according to the time of day\n2) Ability to upload your own images\n3) Applying filters, which are adjustable on the left panel, to a photo (the state of the filters is intentionally saved when changing a photo)\n4) Ability to download an image with filters applied\n5) A button that allows you to reset all filters to their original state",
    "deployLink": "https://stavrovadv.github.io/photo-filter/",
    "codeLink": "https://github.com/stavrovadv/photo-filter"
  },
  {
    "title": "Virtual Piano",
    "img": "./img/projects/virtualpiano.jpg",
    "technologies": [
        "JavaScript"
      ],
    "text": "It was also one of the first js projects. The html and css files were given. I needed to implement piano playing using date attributes. Sounds are played when you click on the keys and press the keyboard keys corresponding to the letters. Locked repeated sound when stopped on a key. Playback in Cyrillic is blocked.",
    "deployLink": "https://stavrovadv.github.io/piano/",
    "codeLink": "https://github.com/stavrovadv/piano"
  },
  {
    "title": "Async-race",
    "img": "./img/projects/async-race.jpg",
    "technologies": [
        "TypeScript"
      ],
    "text": "SPA application. Build a webpack. Asynchronous typescript, work with rest api",
    "deployLink": "#",
    "codeLink": "#"
  }
]